abraham120/erika2/pkg/mcu/renesas_r5f5210x/inc/iodefine.h
enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_FCUIF_FCUERR=0x02,
IER_FCUIF_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,
IER_CMT3_CMI3=0x03,
IER_CAC_FERRF=0x04,
IER_CAC_MENDF=0x04,
IER_CAC_OVFF=0x04,
IER_RSPI0_SPEI2=0x05,
IER_RSPI0_SPRI0=0x05,
IER_RSPI0_SPTI0=0x05,
IER_RSPI0_SPII0=0x05,
IER_DOC_DOPCF=0x07,
IER_CMPB0_COMPB0=0x07,
IER_CMPB1_COMPB1=0x07,
IER_RTC_COUNTUP=0x07,
IER_ICU_IRQ0=0x08,
IER_ICU_IRQ1=0x08,
IER_ICU_IRQ2=0x08,
IER_ICU_IRQ3=0x08,
IER_ICU_IRQ4=0x08,
IER_ICU_IRQ5=0x08,
IER_ICU_IRQ6=0x08,
IER_ICU_IRQ7=0x08,
IER_LVDCMPA_LVD1COMPA1=0x0B,
IER_LVDCMPA_LVD1COMPA2=0x0B,
IER_RTC_ALM=0x0B,
IER_RTC_PRD=0x0B,
IER_S12AD_S12ADI=0x0C,
IER_S12AD_GBADI=0x0C,
IER_ELC_ELSR18I=0x0D,
IER_ELC_ELSR19I=0x0D,
IER_MTU0_TGIA0=0x0E,
IER_MTU0_TGIB0=0x0E,
IER_MTU0_TGIC0=0x0E,
IER_MTU0_TGID0=0x0E,
IER_MTU0_TGIV0=0x0E,
IER_MTU0_TGIE0=0x0E,
IER_MTU0_TGIF0=0x0F,
IER_MTU1_TGIA1=0x0F,
IER_MTU1_TGIB1=0x0F,
IER_MTU1_TGIV1=0x0F,
IER_MTU1_TGIU1=0x0F,
IER_MTU2_TGIA2=0x0F,
IER_MTU2_TGIB2=0x0F,
IER_MTU2_TGIV2=0x0F,
IER_MTU2_TGIU2=0x0F,
IER_MTU3_TGIA3=0x10,
IER_MTU3_TGIB3=0x10,
IER_MTU3_TGIC3=0x10,
IER_MTU3_TGID3=0x10,
IER_MTU3_TGIV3=0x10,
IER_MTU4_TGIA4=0x10,
IER_MTU4_TGIB4=0x10,
IER_MTU4_TGIC4=0x11,
IER_MTU4_TGID4=0x11,
IER_MTU4_TGIV4=0x11,
IER_MTU5_TGIU5=0x11,
IER_MTU5_TGIV5=0x11,
IER_MTU5_TGIW5=0x11,
IER_POE_OEI1=0x15,
IER_POE_OEI2=0x15,
IER_TMR0_CMIA0=0x15,
IER_TMR0_CMIB0=0x15,
IER_TMR0_OVI0=0x16,
IER_TMR1_CMIA1=0x16,
IER_TMR1_CMIB1=0x16,
IER_TMR1_OVI1=0x16,
IER_TMR2_CMIA2=0x16,
IER_TMR2_CMIB2=0x16,
IER_TMR2_OVI2=0x16,
IER_TMR3_CMIA3=0x16,
IER_TMR3_CMIB3=0x17,
IER_TMR3_OVI3=0x17,
IER_DMAC_DMAC0I=0x18,
IER_DMAC_DMAC1I=0x18,
IER_DMAC_DMAC2I=0x19,
IER_DMAC_DMAC3I=0x19,
IER_SCI0_ERI0=0x1A,
IER_SCI0_RXI0=0x1A,
IER_SCI0_TXI0=0x1B,
IER_SCI0_TEI0=0x1B,
IER_SCI1_ERI1=0x1B,
IER_SCI1_RXI1=0x1B,
IER_SCI1_TXI1=0x1B,
IER_SCI1_TEI1=0x1B,
IER_SCI5_ERI5=0x1B,
IER_SCI5_RXI5=0x1B,
IER_SCI5_TXI5=0x1C,
IER_SCI5_TEI5=0x1C,
IER_SCI6_ERI6=0x1C,
IER_SCI6_RXI6=0x1C,
IER_SCI6_TXI6=0x1C,
IER_SCI6_TEI6=0x1C,
IER_SCI8_ERI8=0x1C,
IER_SCI8_RXI8=0x1C,
IER_SCI8_TXI8=0x1D,
IER_SCI8_TEI8=0x1D,
IER_SCI9_ERI9=0x1D,
IER_SCI9_RXI9=0x1D,
IER_SCI9_TXI9=0x1D,
IER_SCI9_TEI9=0x1D,
IER_SCI12_ERI12=0x1D,
IER_SCI12_RXI12=0x1D,
IER_SCI12_TXI12=0x1E,
IER_SCI12_TEI12=0x1E,
IER_SCI12_SCIX0=0x1E,
IER_SCI12_SCIX1=0x1E,
IER_SCI12_SCIX2=0x1E,
IER_SCI12_SCIX3=0x1E,
IER_RIIC0_EEI0=0x1E,
IER_RIIC0_RXI0=0x1E,
IER_RIIC0_TXI0=0x1F,
IER_RIIC0_TEI0=0x1F
};

enum enum_ipr {
IPR_BSC_BUSERR			=0,
IPR_FCUIF_FCUERR		=1,
IPR_FCUIF_FRDYI			=2,
IPR_ICU_SWINT			=3,
IPR_CMT0_CMI0			=4,
IPR_CMT1_CMI1			=5,
IPR_CMT2_CMI2			=6,
IPR_CMT3_CMI3			=7,
IPR_CAC_FERRF			=32,
IPR_CAC_MENDF			=33,
IPR_CAC_OVFF			=34,
IPR_RSPI0_SPEI2			=44,
IPR_RSPI0_SPRI0			=44,
IPR_RSPI0_SPTI0			=44,
IPR_RSPI0_SPII0			=44,
IPR_DOC_DOPCF			=57,
IPR_CMPB0_COMPB0		=58,
IPR_CMPB1_COMPB1		=59,
IPR_RTC_COUNTUP			=63,
IPR_ICU_IRQ0			=64,
IPR_ICU_IRQ1			=65,
IPR_ICU_IRQ2			=66,
IPR_ICU_IRQ3			=67,
IPR_ICU_IRQ4			=68,
IPR_ICU_IRQ5			=69,
IPR_ICU_IRQ6			=70,
IPR_ICU_IRQ7			=71,
IPR_LVDCMPA_LVD1COMPA1	=88,
IPR_LVDCMPA_LVD1COMPA2	=89,
IPR_RTC_ALM				=92,
IPR_RTC_PRD				=93,
IPR_S12AD_S12ADI		=102,
IPR_S12AD_GBADI			=103,
IPR_ELC_ELSR18I			=106,
IPR_ELC_ELSR19I			=107,
IPR_MTU0_TGIA0			=114,
IPR_MTU0_TGIB0			=114,
IPR_MTU0_TGIC0			=114,
IPR_MTU0_TGID0			=114,
IPR_MTU0_TGIV0			=118,
IPR_MTU0_TGIE0			=118,
IPR_MTU0_TGIF0			=118,
IPR_MTU1_TGIA1			=121,
IPR_MTU1_TGIB1			=121,
IPR_MTU1_TGIV1			=123,
IPR_MTU1_TGIU1			=123,
IPR_MTU2_TGIA2			=125,
IPR_MTU2_TGIB2			=125,
IPR_MTU2_TGIV2			=127,
IPR_MTU2_TGIU2			=127,
IPR_MTU3_TGIA3			=129,
IPR_MTU3_TGIB3			=129,
IPR_MTU3_TGIC3			=129,
IPR_MTU3_TGID3			=129,
IPR_MTU3_TGIV3			=133,
IPR_MTU4_TGIA4			=134,
IPR_MTU4_TGIB4			=134,
IPR_MTU4_TGIC4			=134,
IPR_MTU4_TGID4			=134,
IPR_MTU4_TGIV4			=138,
IPR_MTU5_TGIU5			=139,
IPR_MTU5_TGIV5			=139,
IPR_MTU5_TGIW5			=139,
IPR_POE_OEI1			=170,
IPR_POE_OEI2			=171,
IPR_TMR0_CMIA0			=174,
IPR_TMR0_CMIB0			=174,
IPR_TMR0_OVI0			=174,
IPR_TMR1_CMIA1			=177,
IPR_TMR1_CMIB1			=177,
IPR_TMR1_OVI1			=177,
IPR_TMR2_CMIA2			=180,
IPR_TMR2_CMIB2			=180,
IPR_TMR2_OVI2			=180,
IPR_TMR3_CMIA3			=183,
IPR_TMR3_CMIB3			=183,
IPR_TMR3_OVI3			=183,
IPR_DMAC_DMAC0I			=198,
IPR_DMAC_DMAC1I			=199,
IPR_DMAC_DMAC2I			=200,
IPR_DMAC_DMAC3I			=201,
IPR_SCI0_ERI0			=214,
IPR_SCI0_RXI0			=214,
IPR_SCI0_TXI0			=214,
IPR_SCI0_TEI0			=214,
IPR_SCI1_ERI1			=218,
IPR_SCI1_RXI1			=218,
IPR_SCI1_TXI1			=218,
IPR_SCI1_TEI1			=218,
IPR_SCI5_ERI5			=222,
IPR_SCI5_RXI5			=222,
IPR_SCI5_TXI5			=222,
IPR_SCI5_TEI5			=222,
IPR_SCI6_ERI6			=226,
IPR_SCI6_RXI6			=226,
IPR_SCI6_TXI6			=226,
IPR_SCI6_TEI6			=226,
IPR_SCI8_ERI8			=230,
IPR_SCI8_RXI8			=230,
IPR_SCI8_TXI8			=230,
IPR_SCI8_TEI8			=230,
IPR_SCI9_ERI9			=234,
IPR_SCI9_RXI9			=234,
IPR_SCI9_TXI9			=234,
IPR_SCI9_TEI9			=234,
IPR_SCI12_ERI12			=238,
IPR_SCI12_RXI12			=238,
IPR_SCI12_TXI12			=238,
IPR_SCI12_TEI12			=238,
IPR_SCI12_SCIX0			=242,
IPR_SCI12_SCIX1			=243,
IPR_SCI12_SCIX2			=244,
IPR_SCI12_SCIX3			=245,
IPR_RIIC0_EEI0			=246,
IPR_RIIC0_RXI0			=247,
IPR_RIIC0_TXI0			=248,
IPR_RIIC0_TEI0			=249,
IPR_MTU0_TGI			=118,
IPR_MTU1_TGI			=123,
IPR_MTU2_TGI			=127,
IPR_MTU5_				=139,
IPR_MTU5_TGI			=139,
IPR_TMR0_				=174,
IPR_TMR1_				=177,
IPR_TMR2_				=180,
IPR_TMR3_				=183,
IPR_SCI0_				=214,
IPR_SCI1_				=218,
IPR_SCI5_				=222,
IPR_SCI6_				=226,
IPR_SCI8_				=230,
IPR_SCI9_				=234
};

#define	IEN_BSC_BUSERR		IEN0
#define	IEN_FCUIF_FCUERR	IEN5
#define	IEN_FCUIF_FRDYI		IEN7
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_CAC_FERRF		IEN0
#define	IEN_CAC_MENDF		IEN1
#define	IEN_CAC_OVFF		IEN2
#define	IEN_RSPI0_SPEI2		IEN4
#define	IEN_RSPI0_SPRI0		IEN5
#define	IEN_RSPI0_SPTI0		IEN6
#define	IEN_RSPI0_SPII0		IEN7
#define	IEN_DOC_DOPCF		IEN1
#define	IEN_CMPB0_COMPB0	IEN2
#define	IEN_CMPB1_COMPB1	IEN3
#define	IEN_RTC_COUNTUP		IEN7
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_LVDCMPA_LVD1COMPA1	IEN0
#define	IEN_LVDCMPA_LVD1COMPA2	IEN1
#define	IEN_RTC_ALM			IEN4
#define	IEN_RTC_PRD			IEN5
#define	IEN_S12AD_S12ADI	IEN6
#define	IEN_S12AD_GBADI		IEN7
#define	IEN_ELC_ELSR18I		IEN2
#define	IEN_ELC_ELSR19I		IEN3
#define	IEN_MTU0_TGIA0		IEN2
#define	IEN_MTU0_TGIB0		IEN3
#define	IEN_MTU0_TGIC0		IEN4
#define	IEN_MTU0_TGID0		IEN5
#define	IEN_MTU0_TGIV0		IEN6
#define	IEN_MTU0_TGIE0		IEN7
#define	IEN_MTU0_TGIF0		IEN0
#define	IEN_MTU1_TGIA1		IEN1
#define	IEN_MTU1_TGIB1		IEN2
#define	IEN_MTU1_TGIV1		IEN3
#define	IEN_MTU1_TGIU1		IEN4
#define	IEN_MTU2_TGIA2		IEN1
#define	IEN_MTU2_TGIB2		IEN2
#define	IEN_MTU2_TGIV2		IEN3
#define	IEN_MTU2_TGIU2		IEN4
#define	IEN_MTU3_TGIA3		IEN1
#define	IEN_MTU3_TGIB3		IEN2
#define	IEN_MTU3_TGIC3		IEN3
#define	IEN_MTU3_TGID3		IEN4
#define	IEN_MTU3_TGIV3		IEN5
#define	IEN_MTU4_TGIA4		IEN6
#define	IEN_MTU4_TGIB4		IEN7
#define	IEN_MTU4_TGIC4		IEN0
#define	IEN_MTU4_TGID4		IEN1
#define	IEN_MTU4_TGIV4		IEN2
#define	IEN_MTU5_TGIU5		IEN3
#define	IEN_MTU5_TGIV5		IEN4
#define	IEN_MTU5_TGIW5		IEN5
#define	IEN_POE_OEI1		IEN2
#define	IEN_POE_OEI2		IEN3
#define	IEN_TMR0_CMIA0		IEN6
#define	IEN_TMR0_CMIB0		IEN7
#define	IEN_TMR0_OVI0		IEN0
#define	IEN_TMR1_CMIA1		IEN1
#define	IEN_TMR1_CMIB1		IEN2
#define	IEN_TMR1_OVI1		IEN3
#define	IEN_TMR2_CMIA2		IEN4
#define	IEN_TMR2_CMIB2		IEN5
#define	IEN_TMR2_OVI2		IEN6
#define	IEN_TMR3_CMIA3		IEN7
#define	IEN_TMR3_CMIB3		IEN0
#define	IEN_TMR3_OVI3		IEN1
#define	IEN_DMAC_DMAC0I		IEN6
#define	IEN_DMAC_DMAC1I		IEN7
#define	IEN_DMAC_DMAC2I		IEN0
#define	IEN_DMAC_DMAC3I		IEN1
#define	IEN_SCI0_ERI0		IEN6
#define	IEN_SCI0_RXI0		IEN7
#define	IEN_SCI0_TXI0		IEN0
#define	IEN_SCI0_TEI0		IEN1
#define	IEN_SCI1_ERI1		IEN2
#define	IEN_SCI1_RXI1		IEN3
#define	IEN_SCI1_TXI1		IEN4
#define	IEN_SCI1_TEI1		IEN5
#define	IEN_SCI5_ERI5		IEN6
#define	IEN_SCI5_RXI5		IEN7
#define	IEN_SCI5_TXI5		IEN0
#define	IEN_SCI5_TEI5		IEN1
#define	IEN_SCI6_ERI6		IEN2
#define	IEN_SCI6_RXI6		IEN3
#define	IEN_SCI6_TXI6		IEN4
#define	IEN_SCI6_TEI6		IEN5
#define	IEN_SCI8_ERI8		IEN6
#define	IEN_SCI8_RXI8		IEN7
#define	IEN_SCI8_TXI8		IEN0
#define	IEN_SCI8_TEI8		IEN1
#define	IEN_SCI9_ERI9		IEN2
#define	IEN_SCI9_RXI9		IEN3
#define	IEN_SCI9_TXI9		IEN4
#define	IEN_SCI9_TEI9		IEN5
#define	IEN_SCI12_ERI12		IEN6
#define	IEN_SCI12_RXI12		IEN7
#define	IEN_SCI12_TXI12		IEN0
#define	IEN_SCI12_TEI12		IEN1
#define	IEN_SCI12_SCIX0		IEN2
#define	IEN_SCI12_SCIX1		IEN3
#define	IEN_SCI12_SCIX2		IEN4
#define	IEN_SCI12_SCIX3		IEN5
#define	IEN_RIIC0_EEI0		IEN6
#define	IEN_RIIC0_RXI0		IEN7
#define	IEN_RIIC0_TXI0		IEN0
#define	IEN_RIIC0_TEI0		IEN1

#define	VECT_BSC_BUSERR		16
#define	VECT_FCUIF_FCUERR	21
#define	VECT_FCUIF_FRDYI	23
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_CAC_FERRF		32
#define	VECT_CAC_MENDF		33
#define	VECT_CAC_OVFF		34
#define	VECT_RSPI0_SPEI2	44
#define	VECT_RSPI0_SPRI0	45
#define	VECT_RSPI0_SPTI0	46
#define	VECT_RSPI0_SPII0	47
#define	VECT_DOC_DOPCF		57
#define	VECT_CMPB0_COMPB0	58
#define	VECT_CMPB1_COMPB1	59
#define	VECT_RTC_COUNTUP	63
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_LVDCMPA_LVD1COMPA1	88
#define	VECT_LVDCMPA_LVD1COMPA2	89
#define	VECT_RTC_ALM		92
#define	VECT_RTC_PRD		93
#define	VECT_S12AD_S12ADI	102
#define	VECT_S12AD_GBADI	103
#define	VECT_ELC_ELSR18I	106
#define	VECT_ELC_ELSR19I	107
#define	VECT_MTU0_TGIA0		114
#define	VECT_MTU0_TGIB0		115
#define	VECT_MTU0_TGIC0		116
#define	VECT_MTU0_TGID0		117
#define	VECT_MTU0_TGIV0		118
#define	VECT_MTU0_TGIE0		119
#define	VECT_MTU0_TGIF0		120
#define	VECT_MTU1_TGIA1		121
#define	VECT_MTU1_TGIB1		122
#define	VECT_MTU1_TGIV1		123
#define	VECT_MTU1_TGIU1		124
#define	VECT_MTU2_TGIA2		125
#define	VECT_MTU2_TGIB2		126
#define	VECT_MTU2_TGIV2		127
#define	VECT_MTU2_TGIU2		128
#define	VECT_MTU3_TGIA3		129
#define	VECT_MTU3_TGIB3		130
#define	VECT_MTU3_TGIC3		131
#define	VECT_MTU3_TGID3		132
#define	VECT_MTU3_TGIV3		133
#define	VECT_MTU4_TGIA4		134
#define	VECT_MTU4_TGIB4		135
#define	VECT_MTU4_TGIC4		136
#define	VECT_MTU4_TGID4		137
#define	VECT_MTU4_TGIV4		138
#define	VECT_MTU5_TGIU5		139
#define	VECT_MTU5_TGIV5		140
#define	VECT_MTU5_TGIW5		141
#define	VECT_POE_OEI1		170
#define	VECT_POE_OEI2		171
#define	VECT_TMR0_CMIA0		174
#define	VECT_TMR0_CMIB0		175
#define	VECT_TMR0_OVI0		176
#define	VECT_TMR1_CMIA1		177
#define	VECT_TMR1_CMIB1		178
#define	VECT_TMR1_OVI1		179
#define	VECT_TMR2_CMIA2		180
#define	VECT_TMR2_CMIB2		181
#define	VECT_TMR2_OVI2		182
#define	VECT_TMR3_CMIA3		183
#define	VECT_TMR3_CMIB3		184
#define	VECT_TMR3_OVI3		185
#define	VECT_DMAC_DMAC0I	198
#define	VECT_DMAC_DMAC1I	199
#define	VECT_DMAC_DMAC2I	200
#define	VECT_DMAC_DMAC3I	201
#define	VECT_SCI0_ERI0		214
#define	VECT_SCI0_RXI0		215
#define	VECT_SCI0_TXI0		216
#define	VECT_SCI0_TEI0		217
#define	VECT_SCI1_ERI1		218
#define	VECT_SCI1_RXI1		219
#define	VECT_SCI1_TXI1		220
#define	VECT_SCI1_TEI1		221
#define	VECT_SCI5_ERI5		222
#define	VECT_SCI5_RXI5		223
#define	VECT_SCI5_TXI5		224
#define	VECT_SCI5_TEI5		225
#define	VECT_SCI6_ERI6		226
#define	VECT_SCI6_RXI6		227
#define	VECT_SCI6_TXI6		228
#define	VECT_SCI6_TEI6		229
#define	VECT_SCI8_ERI8		230
#define	VECT_SCI8_RXI8		231
#define	VECT_SCI8_TXI8		232
#define	VECT_SCI8_TEI8		233
#define	VECT_SCI9_ERI9		234
#define	VECT_SCI9_RXI9		235
#define	VECT_SCI9_TXI9		236
#define	VECT_SCI9_TEI9		237
#define	VECT_SCI12_ERI12	238
#define	VECT_SCI12_RXI12	239
#define	VECT_SCI12_TXI12	240
#define	VECT_SCI12_TEI12	241
#define	VECT_SCI12_SCIX0	242
#define	VECT_SCI12_SCIX1	243
#define	VECT_SCI12_SCIX2	244
#define	VECT_SCI12_SCIX3	245
#define	VECT_RIIC0_EEI0		246
#define	VECT_RIIC0_RXI0		247
#define	VECT_RIIC0_TXI0		248
#define	VECT_RIIC0_TEI0		249

#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_SCI0	SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPB	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_ELC	SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_TEMPS	SYSTEM.MSTPCRB.BIT.MSTPB8
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12	SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_RAM0	SYSTEM.MSTPCRC.BIT.MSTPC0

