abraham120/erika2/pkg/mcu/renesas_r5f5210x/inc/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc      __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac      __evenaccess *)0x8B000)
#define	CMPB	(*(volatile struct st_cmpb     __evenaccess *)0x8C580)
#define	CMT		(*(volatile struct st_cmt      __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0     __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0     __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0     __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0     __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc      __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da       __evenaccess *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac     __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0    __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1    __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1    __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1    __evenaccess *)0x820C0)
#define	DOC		(*(volatile struct st_doc      __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc      __evenaccess *)0x82400)
#define	ELC		(*(volatile struct st_elc      __evenaccess *)0x8B100)
#define	EXSYSTEM		(*(volatile struct st_exsystem __evenaccess *)0xFF7FFFF8)
#define	FLASH	(*(volatile struct st_flash    __evenaccess *)0x8C296)
#define	ICU		(*(volatile struct st_icu      __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt     __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc      __evenaccess *)0x8C11F)
#define	MTU		(*(volatile struct st_mtu      __evenaccess *)0x8860A)
#define	MTU0	(*(volatile struct st_mtu0     __evenaccess *)0x88700)
#define	MTU1	(*(volatile struct st_mtu1     __evenaccess *)0x88780)
#define	MTU2	(*(volatile struct st_mtu2     __evenaccess *)0x88800)
#define	MTU3	(*(volatile struct st_mtu3     __evenaccess *)0x88600)
#define	MTU4	(*(volatile struct st_mtu4     __evenaccess *)0x88600)
#define	MTU5	(*(volatile struct st_mtu5     __evenaccess *)0x88880)
#define	POE		(*(volatile struct st_poe      __evenaccess *)0x88900)
#define	PORT	(*(volatile struct st_port     __evenaccess *)0x8C100)
#define	PORT0	(*(volatile struct st_port0    __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1    __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2    __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3    __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4    __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5    __evenaccess *)0x8C005)
#define	PORTA	(*(volatile struct st_porta    __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb    __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc    __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd    __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte    __evenaccess *)0x8C00E)
#define	PORTH	(*(volatile struct st_porth    __evenaccess *)0x8C011)
#define	PORTJ	(*(volatile struct st_portj    __evenaccess *)0x8C012)
#define	RIIC0	(*(volatile struct st_riic     __evenaccess *)0x88300)
#define	RSPI0	(*(volatile struct st_rspi     __evenaccess *)0x88380)
#define	RTC		(*(volatile struct st_rtc      __evenaccess *)0x8C400)
#define	S12AD	(*(volatile struct st_s12ad    __evenaccess *)0x89000)
#define	SCI0	(*(volatile struct st_sci0     __evenaccess *)0x8A000)
#define	SCI1	(*(volatile struct st_sci1     __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1     __evenaccess *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci1     __evenaccess *)0x8A0C0)
#define	SCI8	(*(volatile struct st_sci1     __evenaccess *)0x8A100)
#define	SCI9	(*(volatile struct st_sci1     __evenaccess *)0x8A120)
#define	SCI12	(*(volatile struct st_sci12    __evenaccess *)0x8B300)
#define	SMCI0	(*(volatile struct st_smci     __evenaccess *)0x8A000)
#define	SMCI1	(*(volatile struct st_smci     __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci     __evenaccess *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci     __evenaccess *)0x8A0C0)
#define	SMCI8	(*(volatile struct st_smci     __evenaccess *)0x8A100)
#define	SMCI9	(*(volatile struct st_smci     __evenaccess *)0x8A120)
#define	SMCI12	(*(volatile struct st_smci     __evenaccess *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system   __evenaccess *)0x80000)
#define	TEMPS	(*(volatile struct st_temps    __evenaccess *)0x8C500)
#define	TMR0	(*(volatile struct st_tmr0     __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1     __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0     __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1     __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01    __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01    __evenaccess *)0x88214)
#define	WDT		(*(volatile struct st_wdt      __evenaccess *)0x88020)
#pragma bit_order
#pragma packoption
#endif